

#define NEKO_GUI_INCLUDE_FIXED_TYPES
#define NEKO_GUI_INCLUDE_STANDARD_IO
#define NEKO_GUI_INCLUDE_STANDARD_VARARGS
#define NEKO_GUI_INCLUDE_DEFAULT_ALLOCATOR
#define NEKO_GUI_INCLUDE_VERTEX_BUFFER_OUTPUT
#define NEKO_GUI_INCLUDE_FONT_BAKING
#define NEKO_GUI_INCLUDE_DEFAULT_FONT
#define NEKO_GUI_UINT_DRAW_INDEX
#define NEKO_GUI_INCLUDE_STANDARD_BOOL

#ifndef NEKO_GUI_IMPL_H
#define NEKO_GUI_IMPL_H

#ifdef __cplusplus
extern "C" {
#endif

#define NEKO_GUI_UNDEFINED (-1.0f)
#define NEKO_GUI_UTF_INVALID 0xFFFD
#define NEKO_GUI_UTF_SIZE 4
#ifndef NEKO_GUI_INPUT_MAX
#define NEKO_GUI_INPUT_MAX 16
#endif
#ifndef NEKO_GUI_MAX_NUMBER_BUFFER
#define NEKO_GUI_MAX_NUMBER_BUFFER 64
#endif
#ifndef NEKO_GUI_SCROLLBAR_HIDING_TIMEOUT
#define NEKO_GUI_SCROLLBAR_HIDING_TIMEOUT 4.0f
#endif

#define NEKO_GUI_API extern
#define NEKO_GUI_LIB static

#define NEKO_GUI_INTERN static
#define NEKO_GUI_STORAGE static
#define NEKO_GUI_GLOBAL static

#define NEKO_GUI_FLAG(x) (1 << (x))
#define NEKO_GUI_STRINGIFY(x) #x
#define NEKO_GUI_MACRO_STRINGIFY(x) NEKO_GUI_STRINGIFY(x)
#define NEKO_GUI_STRING_JOIN_IMMEDIATE(arg1, arg2) arg1##arg2
#define NEKO_GUI_STRING_JOIN_DELAY(arg1, arg2) NEKO_GUI_STRING_JOIN_IMMEDIATE(arg1, arg2)
#define NEKO_GUI_STRING_JOIN(arg1, arg2) NEKO_GUI_STRING_JOIN_DELAY(arg1, arg2)

#ifdef _MSC_VER
#define NEKO_GUI_UNIQUE_NAME(name) NEKO_GUI_STRING_JOIN(name, __COUNTER__)
#else
#define NEKO_GUI_UNIQUE_NAME(name) NEKO_GUI_STRING_JOIN(name, __LINE__)
#endif


#include <stdarg.h>
#if defined(_MSC_VER) && (_MSC_VER >= 1600)
#include <sal.h>
#define NEKO_GUI_PRINTF_FORMAT_STRING _Printf_format_string_
#else
#define NEKO_GUI_PRINTF_FORMAT_STRING
#endif
#if defined(__GNUC__)
#define NEKO_GUI_PRINTF_VARARG_FUNC(fmtargnumber) __attribute__((format(__printf__, fmtargnumber, fmtargnumber + 1)))
#define NEKO_GUI_PRINTF_VALIST_FUNC(fmtargnumber) __attribute__((format(__printf__, fmtargnumber, 0)))
#else
#define NEKO_GUI_PRINTF_VARARG_FUNC(fmtargnumber)
#define NEKO_GUI_PRINTF_VALIST_FUNC(fmtargnumber)
#endif
#endif

#ifdef NEKO_GUI_INCLUDE_FIXED_TYPES
#include <stdint.h>
#define NEKO_GUI_INT8 int8_t
#define NEKO_GUI_UINT8 uint8_t
#define NEKO_GUI_INT16 int16_t
#define NEKO_GUI_UINT16 uint16_t
#define NEKO_GUI_INT32 int32_t
#define NEKO_GUI_UINT32 uint32_t
#define NEKO_GUI_SIZE_TYPE uintptr_t
#define NEKO_GUI_POINTER_TYPE uintptr_t
#else
#ifndef NEKO_GUI_INT8
#define NEKO_GUI_INT8 signed char
#endif
#ifndef NEKO_GUI_UINT8
#define NEKO_GUI_UINT8 unsigned char
#endif
#ifndef NEKO_GUI_INT16
#define NEKO_GUI_INT16 signed short
#endif
#ifndef NEKO_GUI_UINT16
#define NEKO_GUI_UINT16 unsigned short
#endif
#ifndef NEKO_GUI_INT32
#if defined(_MSC_VER)
#define NEKO_GUI_INT32 __int32
#else
#define NEKO_GUI_INT32 signed int
#endif
#endif
#ifndef NEKO_GUI_UINT32
#if defined(_MSC_VER)
#define NEKO_GUI_UINT32 unsigned __int32
#else
#define NEKO_GUI_UINT32 unsigned int
#endif
#endif
#ifndef NEKO_GUI_SIZE_TYPE
#if defined(_WIN64) && defined(_MSC_VER)
#define NEKO_GUI_SIZE_TYPE unsigned __int64
#elif (defined(_WIN32) || defined(WIN32)) && defined(_MSC_VER)
#define NEKO_GUI_SIZE_TYPE unsigned __int32
#elif defined(__GNUC__) || defined(__clang__)
#if defined(__x86_64__) || defined(__ppc64__) || defined(__aarch64__)
#define NEKO_GUI_SIZE_TYPE unsigned long
#else
#define NEKO_GUI_SIZE_TYPE unsigned int
#endif
#else
#define NEKO_GUI_SIZE_TYPE unsigned long
#endif
#endif
#ifndef NEKO_GUI_POINTER_TYPE
#if defined(_WIN64) && defined(_MSC_VER)
#define NEKO_GUI_POINTER_TYPE unsigned __int64
#elif (defined(_WIN32) || defined(WIN32)) && defined(_MSC_VER)
#define NEKO_GUI_POINTER_TYPE unsigned __int32
#elif defined(__GNUC__) || defined(__clang__)
#if defined(__x86_64__) || defined(__ppc64__) || defined(__aarch64__)
#define NEKO_GUI_POINTER_TYPE unsigned long
#else
#define NEKO_GUI_POINTER_TYPE unsigned int
#endif
#else
#define NEKO_GUI_POINTER_TYPE unsigned long
#endif
#endif
#endif

//#include <stdbool.h>
#define NEKO_GUI_BOOL bool

typedef NEKO_GUI_INT8 neko_gui_char;
typedef NEKO_GUI_UINT8 neko_gui_uchar;
typedef NEKO_GUI_UINT8 neko_gui_byte;
typedef NEKO_GUI_INT16 neko_gui_short;
typedef NEKO_GUI_UINT16 neko_gui_ushort;
typedef NEKO_GUI_INT32 neko_gui_int;
typedef NEKO_GUI_UINT32 neko_gui_uint;
typedef NEKO_GUI_SIZE_TYPE neko_gui_size;
typedef NEKO_GUI_POINTER_TYPE neko_gui_ptr;
typedef NEKO_GUI_BOOL neko_gui_bool;

typedef neko_gui_uint neko_gui_hash;
typedef neko_gui_uint neko_gui_flags;
typedef neko_gui_uint neko_gui_rune;

NEKO_GUI_STATIC_ASSERT(sizeof(neko_gui_short) == 2);
NEKO_GUI_STATIC_ASSERT(sizeof(neko_gui_ushort) == 2);
NEKO_GUI_STATIC_ASSERT(sizeof(neko_gui_uint) == 4);
NEKO_GUI_STATIC_ASSERT(sizeof(neko_gui_int) == 4);
NEKO_GUI_STATIC_ASSERT(sizeof(neko_gui_byte) == 1);
NEKO_GUI_STATIC_ASSERT(sizeof(neko_gui_flags) >= 4);
NEKO_GUI_STATIC_ASSERT(sizeof(neko_gui_rune) >= 4);
NEKO_GUI_STATIC_ASSERT(sizeof(neko_gui_size) >= sizeof(void *));
NEKO_GUI_STATIC_ASSERT(sizeof(neko_gui_ptr) >= sizeof(void *));
NEKO_GUI_STATIC_ASSERT(sizeof(neko_gui_bool) == 1);

struct neko_gui_buffer;
struct neko_gui_allocator;
struct neko_gui_command_buffer;
struct neko_gui_draw_command;
struct neko_gui_convert_config;
struct neko_gui_style_item;
struct neko_gui_text_edit;
struct neko_gui_draw_list;
struct neko_gui_user_font;
struct neko_gui_panel;
struct neko_gui_context;
struct neko_gui_draw_vertex_layout_element;
struct neko_gui_style_button;
struct neko_gui_style_toggle;
struct neko_gui_style_selectable;
struct neko_gui_style_slide;
struct neko_gui_style_progress;
struct neko_gui_style_scrollbar;
struct neko_gui_style_edit;
struct neko_gui_style_property;
struct neko_gui_style_chart;
struct neko_gui_style_combo;
struct neko_gui_style_tab;
struct neko_gui_style_window_header;
struct neko_gui_style_window;

enum { neko_gui_false, neko_gui_true };
struct neko_gui_color {
    neko_gui_byte r, g, b, a;
};
struct neko_gui_colorf {
    float r, g, b, a;
};
struct neko_gui_vec2 {
    float x, y;
};
struct neko_gui_vec2i {
