
#include "neko_gui_impl.h"

#ifndef NEKO_GUI_INTERNAL_H
#define NEKO_GUI_INTERNAL_H

#ifndef NEKO_GUI_POOL_DEFAULT_CAPACITY
#define NEKO_GUI_POOL_DEFAULT_CAPACITY 16
#endif

#ifndef NEKO_GUI_DEFAULT_COMMAND_BUFFER_SIZE
#define NEKO_GUI_DEFAULT_COMMAND_BUFFER_SIZE (4 * 1024)
#endif

#ifndef NEKO_GUI_BUFFER_DEFAULT_INITIAL_SIZE
#define NEKO_GUI_BUFFER_DEFAULT_INITIAL_SIZE (4 * 1024)
#endif

#ifdef NEKO_GUI_INCLUDE_DEFAULT_ALLOCATOR
#include <stdlib.h>
#endif
#ifdef NEKO_GUI_INCLUDE_STANDARD_IO
#include <stdio.h>
#endif
#ifdef NEKO_GUI_INCLUDE_STANDARD_VARARGS
#include <stdarg.h>
#endif
#ifndef NEKO_GUI_ASSERT
#include <assert.h>
#define NEKO_GUI_ASSERT(expr) assert(expr)
#endif

#define NEKO_GUI_DEFAULT (-1)

#ifndef NEKO_GUI_VSNPRINTF

#if (defined(__STDC_VERSION__) && (__STDC_VERSION__ >= 199901L)) || (defined(__cplusplus) && (__cplusplus >= 201103L)) || (defined(_POSIX_C_SOURCE) && (_POSIX_C_SOURCE >= 200112L)) || \
        (defined(_XOPEN_SOURCE) && (_XOPEN_SOURCE >= 500)) || defined(_ISOC99_SOURCE) || defined(_BSD_SOURCE)
#define NEKO_GUI_VSNPRINTF(s, n, f, a) vsnprintf(s, n, f, a)
#else
#define NEKO_GUI_VSNPRINTF(s, n, f, a) vsprintf(s, f, a)
#endif
#endif

#define NEKO_GUI_SCHAR_MIN (-127)
#define NEKO_GUI_SCHAR_MAX 127
#define NEKO_GUI_UCHAR_MIN 0
#define NEKO_GUI_UCHAR_MAX 256
#define NEKO_GUI_SSHORT_MIN (-32767)
#define NEKO_GUI_SSHORT_MAX 32767
#define NEKO_GUI_USHORT_MIN 0
#define NEKO_GUI_USHORT_MAX 65535
#define NEKO_GUI_SINT_MIN (-2147483647)
#define NEKO_GUI_SINT_MAX 2147483647
#define NEKO_GUI_UINT_MIN 0
#define NEKO_GUI_UINT_MAX 4294967295u

NEKO_GUI_STATIC_ASSERT(sizeof(neko_gui_size) >= sizeof(void *));
NEKO_GUI_STATIC_ASSERT(sizeof(neko_gui_ptr) == sizeof(void *));
NEKO_GUI_STATIC_ASSERT(sizeof(neko_gui_flags) >= 4);
NEKO_GUI_STATIC_ASSERT(sizeof(neko_gui_rune) >= 4);
NEKO_GUI_STATIC_ASSERT(sizeof(neko_gui_ushort) == 2);
NEKO_GUI_STATIC_ASSERT(sizeof(neko_gui_short) == 2);
NEKO_GUI_STATIC_ASSERT(sizeof(neko_gui_uint) == 4);
NEKO_GUI_STATIC_ASSERT(sizeof(neko_gui_int) == 4);
NEKO_GUI_STATIC_ASSERT(sizeof(neko_gui_byte) == 1);
NEKO_GUI_STATIC_ASSERT(sizeof(neko_gui_bool) == 1);

NEKO_GUI_GLOBAL const struct neko_gui_rect neko_gui_null_rect = {-8192.0f, -8192.0f, 16384, 16384};
#define NEKO_GUI_FLOAT_PRECISION 0.00000000000001

NEKO_GUI_GLOBAL const struct neko_gui_color neko_gui_red = {255, 0, 0, 255};
NEKO_GUI_GLOBAL const struct neko_gui_color neko_gui_green = {0, 255, 0, 255};
NEKO_GUI_GLOBAL const struct neko_gui_color neko_gui_blue = {0, 0, 255, 255};
NEKO_GUI_GLOBAL const struct neko_gui_color neko_gui_white = {255, 255, 255, 255};
NEKO_GUI_GLOBAL const struct neko_gui_color neko_gui_black = {0, 0, 0, 255};
NEKO_GUI_GLOBAL const struct neko_gui_color neko_gui_yellow = {255, 255, 0, 255};

#define neko_gui_widget_state_reset(s)                                            \
    if ((*(s)) & NEKO_GUI_WIDGET_STATE_MODIFIED)                                  \
        (*(s)) = NEKO_GUI_WIDGET_STATE_INACTIVE | NEKO_GUI_WIDGET_STATE_MODIFIED; \
